{
  "extensionName": {
    "message": "Литера 5",
    "description": "Название расширения"
  },
  "extensionDescription": {
    "message": "Возможность проверять текст в любом редакторе текста!",
    "description": "Описание расширения"
  },
  "extensionAuthor": {
    "message": "ООО Орфограмматика",
    "description": "Автор расширения"
  },
  "popup__popupConfirm__yes": {
    "message": "Да",
    "description": "Подпись кнопки 'Да' в диалоге подтверждения"
  },
  "popup__popupConfirm__no": {
    "message": "Нет",
    "description": "Подпись кнопки 'Нет' в диалоге подтверждения"
  },
  "contentSpellcheck__testEditorContent__confirmCopyClipboardOnInsertError__title": {
    "message": "Скопировать в буфер обмена?",
    "description": "Когда не получилось вставить результаты проверки в редактор, заголовок диалога подтверждения"
  },
  "contentSpellcheck__testEditorContent__confirmCopyClipboardOnInsertError__message": {
    "message": "Не удалось установить результаты редактирования текста в поле редактора.<br>Желаете скопировать их в буфер обмена?",
    "description": "Когда не получилось вставить результаты проверки в редактор, заголовок диалога подтверждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardCopySuccess__title": {
    "message": "Текст скопирован в буфер",
    "description": "Когда после неудачной попытки установить результаты текст благополучно скопирован в буфер, заголовок диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardCopySuccess__message": {
    "message": "Результаты обработки текста скопированы в буфер обмена.<br>Если они ещё понадобятся, то нажмите кнопку \"Литеры\" в правом нижнем углу вашего текстового редактора, чтобы получить их.",
    "description": "Когда после неудачной попытки установить результаты текст благополучно скопирован в буфер, текст диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardCopyError__title": {
    "message": "Не удалось скопировать текст в буфер",
    "description": "Когда после неудачной попытки установить результаты текст не удалось скопировать в буфер, заголовок диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardCopyError__message": {
    "message": "Результаты обработки текста не удалось скопировать в буфер обмена.<br>Если они понадобятся, то нажмите кнопку \"Литеры\" в правом нижнем углу вашего текстового редактора, чтобы получить их.",
    "description": "Когда после неудачной попытки установить результаты текст не удалось скопировать в буфер, текст диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertUserRejectedCopy__title": {
    "message": "",
    "description": "Когда после неудачной попытки установить результаты пользователь отказался копировать текст в буфер, заголовок диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertUserRejectedCopy__message": {
    "message": "Когда результаты редактирования текста понадобятся, вы сможете получить их нажав кнопку \"Литеры\" в правом нижнем углу вашего текстового редактора.",
    "description": "Когда после неудачной попытки установить результаты пользователь отказался копировать текст в буфер, текст диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardAccessDenied__title": {
    "message": "Запрещён доступ к буферу обмена",
    "description": "Когда после неудачной попытки установить результаты оказалось, что не хватает прав на запись в буфер, заголовок диалога предупреждения"
  },
  "contentSpellcheck__testEditorContent__alertClipboardAccessDenied__message": {
    "message": "У вас запрещён доступ к буферу обмена, поэтому, когда результаты редактирования текста понадобятся, вы сможете получить их нажав кнопку \"Литеры\" в правом нижнем углу вашего текстового редактора откуда сможете скопировать их вручную и вставить в требуемое вам поле ввода.",
    "description": "Когда после неудачной попытки установить результаты оказалось, что не хватает прав на запись в буфер, текст диалога предупреждения"
  },
  "contentSpellcheck__showResults__title": {
    "message": "Результаты последней проверки",
    "description": "Диалог сохранённых результатов проверки, заголовок диалога"
  },
  "contentSpellcheck__showResults__clipButton__caption": {
    "message": "Скопировать результаты в буфер",
    "description": "Диалог сохранённых результатов проверки, заголовок кнопки копирования результатов в буфер"
  },
  "contentSpellcheck__showResults__recheckButton__caption": {
    "message": "Проверить текст из редактора",
    "description": "Диалог сохранённых результатов проверки, заголовок кнопки повторной проверки текста из редактора"
  },
  "contentSpellcheck__showResults__alertCopySuccess__title": {
    "message": "Результаты скопированы в буфер",
    "description": "Диалог сохранённых результатов проверки, сообщение о благополучном копировании текста в буфер, заголовок диалога"
  },
  "contentSpellcheck__showResults__alertCopySuccess__message": {
    "message": "Результаты успешно скопированы в буфер обмена, вставьте их в ваше поле редактора.",
    "description": "Диалог сохранённых результатов проверки, сообщение о благополучном копировании текста в буфер, текст диалога"
  },
  "contentSpellcheck__showResults__alertCopyError__title": {
    "message": "Не удалось скопировать текст в буфер обмена автоматически",
    "description": "Диалог сохранённых результатов проверки, сообщение об ошибке копирования текста в буфер, заголовок диалога"
  },
  "contentSpellcheck__showResults__alertCopyError__message": {
    "message": "Пожалуйста, выделите нужный вам текст и скопируйте его при помощи клавиш <code>Ctrl-C</code> / <code>Command-C</code>",
    "description": "Диалог сохранённых результатов проверки, сообщение об ошибке копирования текста в буфер, текст диалога"
  },
  "contentSpellcheck__checkText__apiErrorUnauthenticated__title": {
    "message": "Не удалось проверить текст",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, ошибка авторизации, заголовок диалога оповещения"
  },
  "contentSpellcheck__checkText__apiErrorUnauthenticated__message": {
    "message": "Похоже, что изменились параметры входа в Литеру, например, специальный пароль. Пожалуйста, проверьте настройки плагина.",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, ошибка авторизации, текст диалога оповещения"
  },
  "contentSpellcheck__checkText__apiErrorDetailed__title": {
    "message": "Ошибка во время проверки текста",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, ошибка с дополнительным описанием, заголовок диалога оповещения"
  },
  "contentSpellcheck__checkText__apiErrorDetailed__message": {
    "message": "Во время проверки произошла непредвиденная ошибка: \"$DETAIL$\". Пожалуйста убедитесь, что сервер Литеры работает, плагин настроен правильно и у вас есть все необходимые права на работу с Литерой.",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, ошибка с дополнительным описанием, текст диалога оповещения",
    "placeholders": {
      "detail": {
        "content": "$1"
      }
    }
  },
  "contentSpellcheck__checkText__apiErrorGeneric__title": {
    "message": "Ошибка во время проверки текста",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, совсем непредвиденная ошибка без подробностей, заголовок диалога оповещения"
  },
  "contentSpellcheck__checkText__apiErrorGeneric__message": {
    "message": "Во время проверки произошла непредвиденная ошибка. Пожалуйста убедитесь, что сервер Литеры работает, плагин настроен правильно и у вас есть все необходимые права на работу с Литерой.",
    "description": "Начало проверки текста, не удалось инициировать проверку текста по API, совсем непредвиденная ошибка без подробностей, текст диалога оповещения"
  },
  "contentSpellcheck__createButton__title__check": {
    "message": "Проверить текст редактора в Литере",
    "description": "Всплывающая подсказка кнопки Литеры в текстовом поле, режим первичной проверки"
  },
  "contentSpellcheck__createButton__title__result": {
    "message": "Результаты последней проверки",
    "description": "Всплывающая подсказка кнопки Литеры в текстовом поле, режим когда есть неустановленный результат проверки"
  },
  "contentSpellcheck__showEditor__closeButton__title": {
    "message": "Закрыть редактор Литеры",
    "description": "Всплывающая подсказка кнопки 'крестик' всплывающего окна с редактором Литеры"
  }
}